# Factor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CorrectionFactor..::..Factor Property
CorrectionFactor Class See Also
---
Get factor value of wire correction factor.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Factor { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Factor As Double
	Get
```

Visual C++
---
```text
public:
property double Factor {
	double get ();
}
```

# See Also
CorrectionFactor Class
Autodesk.Revit.DB.Electrical Namespace